app/Http/Controllers/API/Results/CrossCountry/TeamResultController.php

select * from `divisions` where `divisions`.`id` in (1)
select * from `events` where `events`.`id` in (1)
select * from `race_titles` where `race_titles`.`id` in (2)
---
    public function store(CrossCountryMeet $crossCountryMeet, TeamResult $teamResult)
    {
        request()->validate([
            'division_id'   => 'required|integer',
            'race_title_id' => 'integer|nullable',
            'event_id'      => 'required|integer',
            'place'         => 'required|integer|lte:number_teams',
            'number_teams'  => 'required|integer|gte:place',
            'points'        => 'nullable|integer',
        ]);

        $teamResult = $crossCountryMeet->addTeamResult(request([
            'division_id',
            'race_title_id',
            'event_id',
            'place',
            'number_teams',
            'points'
        ]));

        return $teamResult->load('division', 'event', 'title');