app/Http/Controllers/API/Meets/CrossCountryMeetController.php

    public function store(Request $request)
    {
        $crossCountryMeet = request()->validate([
            'cross_country_meet_name_id'              => 'required|integer',
            'meet_date'                 => 'required|date',
            'host_id'                   => 'required|integer',
            'cross_country_venue_id'    => 'required|integer',
            'timing_method_id'          => 'required|integer',
        ]);

        $crossCountryMeet = CrossCountryMeet::create($crossCountryMeet);

        return $crossCountryMeet->load('name', 'timing', 'venue', 'host');
---
select * from `hosts` where `hosts`.`id` in (4)
select * from `meet_names` where `meet_names`.`id` in (5)
select * from `venues` where `venues`.`id` in (4)