app/Http/Controllers/API/Properties/Meets/HostController.php

select * from `hosts`
---
    public function index()
    {
        $hosts = Host::all();