app/Http/Controllers/API/Properties/Meets/VenueController.php

select * from `seasons` where `seasons`.`id` in (2)
select * from `venues` where `season_id` = 2 order by `name` asc
---
    public function index(VenueFilter $filters)
    {
        $venues = Venue::filter($filters)
            ->with('season')
            ->orderBy('name')
            ->get();