app/Filters/VenueFilter.php

select * from `seasons` where `slug` = 'cross-country' limit 1
---
  protected function season($seasonSlug)
  {
    $season = Season::where('slug', $seasonSlug)->firstOrFail();