app/Http/Controllers/PageController.php

    public function welcome()
    {
        $announcements = Announcement::whereDate('end_date', '>=', Carbon::today())->orderBy('updated_at', 'desc')->get();

        $teamEvents = TeamEvent::whereDate('event_date', '>=', Carbon::today())->orderBy('event_date', 'asc')->get();
---
select * from `announcements` where date(`end_date`) >= '2019-08-17' order by `updated_at` desc
select * from `team_events` where date(`event_date`) >= '2019-08-17' order by `event_date` asc