app/Http/Controllers/API/Properties/Races/DivisionController.php

select * from `divisions`
select * from `genders` where `genders`.`id` in (1, 2)
select * from `levels` where `levels`.`id` in (1, 2, 3)
---
    public function index()
    {
        $divisions = Division::with('gender', 'level')->get();