app/Http/Controllers/API/Properties/Races/EventController.php

select * from `events`
---
    public function index()
    {
        $events = Event::all();