app/Http/Controllers/API/Properties/Races/TitleController.php

    public function index()
    {
        $titles = Title::all();
---
select * from `race_titles`

    public function update(Request $request, Title $title)
    {
        request()->validate([
            'name' => 'string|min:3'
        ]);

        $title->update(request(['name']));
---
update `race_titles` set `name` = 'Blue', `updated_at` = '2019-08-17 18:14:48' where `id` = 5

    public function destroy(Title $title)
    {
        $title->delete();
---
delete from `race_titles` where `id` = 5