app/Http/Controllers/Admin/GenderController.php

    public function index()
    {
        $genders = Gender::all();
---
select * from `genders`