app/Http/Controllers/Admin/LevelController.php

select * from `levels`
---
    public function index()
    {
        $levels = Level::all();