app/Http/Controllers/Admin/TitleController.php

select * from `race_titles`
---
    public function index()
    {
        $titles = Title::all();